w4d1/FirstRoutesControllers/app/controllers/contacts_controller.rb

  def create
    contact = Contact.new(contact_params)
    if contact.save
---
INSERT INTO "contacts" ("name", "email", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["name", "App Academy"], ["email", "aa@aa.com"], ["user_id", 1], ["created_at", "2017-02-14 01:48:28.417425"], ["updated_at", "2017-02-14 01:48:28.417425"]]

  def show
    contact = Contact.find(params[:id])
---
SELECT  "contacts".* FROM "contacts" WHERE "contacts"."id" = $1 LIMIT 1  [["id", 1]]

  def update
    contact = Contact.find(params[:id])
    if contact.update(contact_params)
---
SELECT  "contacts".* FROM "contacts" WHERE "contacts"."id" = $1 LIMIT 1  [["id", 3]]
UPDATE "contacts" SET "name" = $1, "updated_at" = $2 WHERE "contacts"."id" = $3  [["name", "App Academy Student"], ["updated_at", "2017-02-14 01:52:00.132437"], ["id", 3]]

  def destroy
    contact = Contact.find(params[:id])
    contact.destroy
---
SELECT  "contacts".* FROM "contacts" WHERE "contacts"."id" = $1 LIMIT 1  [["id", 1]]
DELETE FROM "contacts" WHERE "contacts"."id" = $1  [["id", 1]]